---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthFailsEq
source: html/9ac1d84f-9c4e-581c-2314-428148c464f6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthFailsEq Property

The actual tread depth and riser height for one or more stairs of this type violates the stair equation.

## Syntax (C#)
```csharp
public static FailureDefinitionId TreadDepthFailsEq { get; }
```